Revit 2020 API
GenericZoneDomainData Class
 A base class for specific domain requirements for a generic zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public class GenericZoneDomainData : IDisposable
Visual Basic
Public Class GenericZoneDomainData _
	Implements IDisposable
Visual C++
public ref class GenericZoneDomainData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.GenericZoneDomainData
See Also
GenericZoneDomainData Members
Autodesk.Revit.DB.Analysis Namespace